garyPenhook/PIC-Assembler/device_includes/pic16f17554.inc
// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 010Ch
// bitfield definitions
PMD0_NVMMD_POSN                          equ 0000h
PMD0_NVMMD_POSITION                      equ 0000h
PMD0_NVMMD_SIZE                          equ 0001h
PMD0_NVMMD_LENGTH                        equ 0001h
PMD0_NVMMD_MASK                          equ 0001h
PMD0_CRCMD_POSN                          equ 0001h
PMD0_CRCMD_POSITION                      equ 0001h
PMD0_CRCMD_SIZE                          equ 0001h
PMD0_CRCMD_LENGTH                        equ 0001h
PMD0_CRCMD_MASK                          equ 0002h
PMD0_SCANMD_POSN                         equ 0002h
PMD0_SCANMD_POSITION                     equ 0002h
PMD0_SCANMD_SIZE                         equ 0001h
PMD0_SCANMD_LENGTH                       equ 0001h
PMD0_SCANMD_MASK                         equ 0004h
PMD0_SYSCMD_POSN                         equ 0003h
PMD0_SYSCMD_POSITION                     equ 0003h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0008h
PMD0_ACTMD_POSN                          equ 0004h
PMD0_ACTMD_POSITION                      equ 0004h
PMD0_ACTMD_SIZE                          equ 0001h
PMD0_ACTMD_LENGTH                        equ 0001h
PMD0_ACTMD_MASK                          equ 0010h
PMD0_IOCMD_POSN                          equ 0005h
PMD0_IOCMD_POSITION                      equ 0005h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0020h
PMD0_CLKRMD_POSN                         equ 0006h
PMD0_CLKRMD_POSITION                     equ 0006h
PMD0_CLKRMD_SIZE                         equ 0001h
PMD0_CLKRMD_LENGTH                       equ 0001h
PMD0_CLKRMD_MASK                         equ 0040h
PMD0_TMR0MD_POSN                         equ 0007h
PMD0_TMR0MD_POSITION                     equ 0007h
PMD0_TMR0MD_SIZE                         equ 0001h
PMD0_TMR0MD_LENGTH                       equ 0001h
PMD0_TMR0MD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 010Dh
// bitfield definitions
PMD1_TMR1MD_POSN                         equ 0000h
PMD1_TMR1MD_POSITION                     equ 0000h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0001h
PMD1_TMR3MD_POSN                         equ 0001h
PMD1_TMR3MD_POSITION                     equ 0001h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR4MD_POSN                         equ 0003h
PMD1_TMR4MD_POSITION                     equ 0003h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0008h
PMD1_TMR6MD_POSN                         equ 0004h
PMD1_TMR6MD_POSITION                     equ 0004h
PMD1_TMR6MD_SIZE                         equ 0001h
PMD1_TMR6MD_LENGTH                       equ 0001h
PMD1_TMR6MD_MASK                         equ 0010h
PMD1_CCP1MD_POSN                         equ 0005h
PMD1_CCP1MD_POSITION                     equ 0005h
PMD1_CCP1MD_SIZE                         equ 0001h
PMD1_CCP1MD_LENGTH                       equ 0001h
PMD1_CCP1MD_MASK                         equ 0020h
PMD1_CCP2MD_POSN                         equ 0006h
PMD1_CCP2MD_POSITION                     equ 0006h
PMD1_CCP2MD_SIZE                         equ 0001h
PMD1_CCP2MD_LENGTH                       equ 0001h
PMD1_CCP2MD_MASK                         equ 0040h
PMD1_PWM1MD_POSN                         equ 0007h
PMD1_PWM1MD_POSITION                     equ 0007h
PMD1_PWM1MD_SIZE                         equ 0001h
PMD1_PWM1MD_LENGTH                       equ 0001h
PMD1_PWM1MD_MASK                         equ 0080h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 010Eh
// bitfield definitions
PMD2_PWM2MD_POSN                         equ 0000h
PMD2_PWM2MD_POSITION                     equ 0000h
PMD2_PWM2MD_SIZE                         equ 0001h
PMD2_PWM2MD_LENGTH                       equ 0001h
PMD2_PWM2MD_MASK                         equ 0001h
PMD2_NCO1MD_POSN                         equ 0001h
PMD2_NCO1MD_POSITION                     equ 0001h
PMD2_NCO1MD_SIZE                         equ 0001h
PMD2_NCO1MD_LENGTH                       equ 0001h
PMD2_NCO1MD_MASK                         equ 0002h
PMD2_CWG1MD_POSN                         equ 0002h
PMD2_CWG1MD_POSITION                     equ 0002h
PMD2_CWG1MD_SIZE                         equ 0001h
PMD2_CWG1MD_LENGTH                       equ 0001h
PMD2_CWG1MD_MASK                         equ 0004h
PMD2_CLC1MD_POSN                         equ 0003h
PMD2_CLC1MD_POSITION                     equ 0003h
PMD2_CLC1MD_SIZE                         equ 0001h
PMD2_CLC1MD_LENGTH                       equ 0001h
PMD2_CLC1MD_MASK                         equ 0008h
PMD2_CLC2MD_POSN                         equ 0004h
PMD2_CLC2MD_POSITION                     equ 0004h
PMD2_CLC2MD_SIZE                         equ 0001h
PMD2_CLC2MD_LENGTH                       equ 0001h
PMD2_CLC2MD_MASK                         equ 0010h
PMD2_CLC3MD_POSN                         equ 0005h
PMD2_CLC3MD_POSITION                     equ 0005h
PMD2_CLC3MD_SIZE                         equ 0001h
PMD2_CLC3MD_LENGTH                       equ 0001h
PMD2_CLC3MD_MASK                         equ 0020h
PMD2_CLC4MD_POSN                         equ 0006h
PMD2_CLC4MD_POSITION                     equ 0006h
PMD2_CLC4MD_SIZE                         equ 0001h
PMD2_CLC4MD_LENGTH                       equ 0001h
PMD2_CLC4MD_MASK                         equ 0040h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 010Fh
// bitfield definitions
PMD3_UART1MD_POSN                        equ 0001h
PMD3_UART1MD_POSITION                    equ 0001h
PMD3_UART1MD_SIZE                        equ 0001h
PMD3_UART1MD_LENGTH                      equ 0001h
PMD3_UART1MD_MASK                        equ 0002h
PMD3_UART2MD_POSN                        equ 0002h
PMD3_UART2MD_POSITION                    equ 0002h
PMD3_UART2MD_SIZE                        equ 0001h
PMD3_UART2MD_LENGTH                      equ 0001h
PMD3_UART2MD_MASK                        equ 0004h
PMD3_MSSP1MD_POSN                        equ 0003h
PMD3_MSSP1MD_POSITION                    equ 0003h
PMD3_MSSP1MD_SIZE                        equ 0001h
PMD3_MSSP1MD_LENGTH                      equ 0001h
PMD3_MSSP1MD_MASK                        equ 0008h
PMD3_MSSP2MD_POSN                        equ 0004h
PMD3_MSSP2MD_POSITION                    equ 0004h
PMD3_MSSP2MD_SIZE                        equ 0001h
PMD3_MSSP2MD_LENGTH                      equ 0001h
PMD3_MSSP2MD_MASK                        equ 0010h
PMD3_FVRMD_POSN                          equ 0005h
PMD3_FVRMD_POSITION                      equ 0005h
PMD3_FVRMD_SIZE                          equ 0001h
PMD3_FVRMD_LENGTH                        equ 0001h
PMD3_FVRMD_MASK                          equ 0020h
PMD3_CM1MD_POSN                          equ 0006h
PMD3_CM1MD_POSITION                      equ 0006h
PMD3_CM1MD_SIZE                          equ 0001h
PMD3_CM1MD_LENGTH                        equ 0001h
PMD3_CM1MD_MASK                          equ 0040h
PMD3_CMLP1MD_POSN                        equ 0007h
PMD3_CMLP1MD_POSITION                    equ 0007h
PMD3_CMLP1MD_SIZE                        equ 0001h
PMD3_CMLP1MD_LENGTH                      equ 0001h
PMD3_CMLP1MD_MASK                        equ 0080h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0110h
// bitfield definitions
PMD4_ADCMD_POSN                          equ 0000h
PMD4_ADCMD_POSITION                      equ 0000h
PMD4_ADCMD_SIZE                          equ 0001h
PMD4_ADCMD_LENGTH                        equ 0001h
PMD4_ADCMD_MASK                          equ 0001h
PMD4_DAC1MD_POSN                         equ 0001h
PMD4_DAC1MD_POSITION                     equ 0001h
PMD4_DAC1MD_SIZE                         equ 0001h
PMD4_DAC1MD_LENGTH                       equ 0001h
PMD4_DAC1MD_MASK                         equ 0002h
PMD4_DAC2MD_POSN                         equ 0002h
PMD4_DAC2MD_POSITION                     equ 0002h
PMD4_DAC2MD_SIZE                         equ 0001h
PMD4_DAC2MD_LENGTH                       equ 0001h
PMD4_DAC2MD_MASK                         equ 0004h
PMD4_OPA1MD_POSN                         equ 0003h
PMD4_OPA1MD_POSITION                     equ 0003h
PMD4_OPA1MD_SIZE                         equ 0001h
PMD4_OPA1MD_LENGTH                       equ 0001h
PMD4_OPA1MD_MASK                         equ 0008h
PMD4_OPA2MD_POSN                         equ 0004h
PMD4_OPA2MD_POSITION                     equ 0004h
PMD4_OPA2MD_SIZE                         equ 0001h
PMD4_OPA2MD_LENGTH                       equ 0001h
PMD4_OPA2MD_MASK                         equ 0010h
PMD4_OPA3MD_POSN                         equ 0005h
PMD4_OPA3MD_POSITION                     equ 0005h
PMD4_OPA3MD_SIZE                         equ 0001h
PMD4_OPA3MD_LENGTH                       equ 0001h
PMD4_OPA3MD_MASK                         equ 0020h
PMD4_ZCDMD_POSN                          equ 0007h
PMD4_ZCDMD_POSITION                      equ 0007h
PMD4_ZCDMD_SIZE                          equ 0001h
PMD4_ZCDMD_LENGTH                        equ 0001h
PMD4_ZCDMD_MASK                          equ 0080h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 0111h
// bitfield definitions
PMD5_PORTWMD_POSN                        equ 0000h
PMD5_PORTWMD_POSITION                    equ 0000h
PMD5_PORTWMD_SIZE                        equ 0001h
PMD5_PORTWMD_LENGTH                      equ 0001h
PMD5_PORTWMD_MASK                        equ 0001h
PMD5_VREFLPMD_POSN                       equ 0001h
PMD5_VREFLPMD_POSITION                   equ 0001h
PMD5_VREFLPMD_SIZE                       equ 0001h
PMD5_VREFLPMD_LENGTH                     equ 0001h
PMD5_VREFLPMD_MASK                       equ 0002h
PMD5_APMMD_POSN                          equ 0002h
PMD5_APMMD_POSITION                      equ 0002h
PMD5_APMMD_SIZE                          equ 0001h
PMD5_APMMD_LENGTH                        equ 0001h
PMD5_APMMD_MASK                          equ 0004h

// Register: WDTCON0
#define WDTCON0 WDTCON0
WDTCON0                                  equ 018Ch
// bitfield definitions
WDTCON0_SEN_POSN                         equ 0000h
WDTCON0_SEN_POSITION                     equ 0000h
WDTCON0_SEN_SIZE                         equ 0001h
WDTCON0_SEN_LENGTH                       equ 0001h
WDTCON0_SEN_MASK                         equ 0001h
WDTCON0_PS_POSN                          equ 0001h
WDTCON0_PS_POSITION                      equ 0001h
WDTCON0_PS_SIZE                          equ 0005h
WDTCON0_PS_LENGTH                        equ 0005h
WDTCON0_PS_MASK                          equ 003Eh
WDTCON0_SWDTEN_POSN                      equ 0000h
WDTCON0_SWDTEN_POSITION                  equ 0000h
WDTCON0_SWDTEN_SIZE                      equ 0001h
WDTCON0_SWDTEN_LENGTH                    equ 0001h
WDTCON0_SWDTEN_MASK                      equ 0001h
WDTCON0_WDTPS_POSN                       equ 0001h
WDTCON0_WDTPS_POSITION                   equ 0001h
WDTCON0_WDTPS_SIZE                       equ 0005h
WDTCON0_WDTPS_LENGTH                     equ 0005h
WDTCON0_WDTPS_MASK                       equ 003Eh
WDTCON0_WDTSEN_POSN                      equ 0000h
WDTCON0_WDTSEN_POSITION                  equ 0000h
WDTCON0_WDTSEN_SIZE                      equ 0001h
WDTCON0_WDTSEN_LENGTH                    equ 0001h
WDTCON0_WDTSEN_MASK                      equ 0001h
WDTCON0_PS0_POSN                         equ 0001h
WDTCON0_PS0_POSITION                     equ 0001h
WDTCON0_PS0_SIZE                         equ 0001h
WDTCON0_PS0_LENGTH                       equ 0001h
WDTCON0_PS0_MASK                         equ 0002h
WDTCON0_PS1_POSN                         equ 0002h
WDTCON0_PS1_POSITION                     equ 0002h
WDTCON0_PS1_SIZE                         equ 0001h
WDTCON0_PS1_LENGTH                       equ 0001h
WDTCON0_PS1_MASK                         equ 0004h
WDTCON0_PS2_POSN                         equ 0003h
WDTCON0_PS2_POSITION                     equ 0003h
WDTCON0_PS2_SIZE                         equ 0001h
WDTCON0_PS2_LENGTH                       equ 0001h
WDTCON0_PS2_MASK                         equ 0008h
WDTCON0_PS3_POSN                         equ 0004h
WDTCON0_PS3_POSITION                     equ 0004h
WDTCON0_PS3_SIZE                         equ 0001h
WDTCON0_PS3_LENGTH                       equ 0001h
WDTCON0_PS3_MASK                         equ 0010h
WDTCON0_PS4_POSN                         equ 0005h
WDTCON0_PS4_POSITION                     equ 0005h
WDTCON0_PS4_SIZE                         equ 0001h
WDTCON0_PS4_LENGTH                       equ 0001h
WDTCON0_PS4_MASK                         equ 0020h
WDTCON0_WDTPS0_POSN                      equ 0001h
WDTCON0_WDTPS0_POSITION                  equ 0001h
WDTCON0_WDTPS0_SIZE                      equ 0001h
WDTCON0_WDTPS0_LENGTH                    equ 0001h
WDTCON0_WDTPS0_MASK                      equ 0002h
WDTCON0_WDTPS1_POSN                      equ 0002h
WDTCON0_WDTPS1_POSITION                  equ 0002h
WDTCON0_WDTPS1_SIZE                      equ 0001h
WDTCON0_WDTPS1_LENGTH                    equ 0001h
WDTCON0_WDTPS1_MASK                      equ 0004h
WDTCON0_WDTPS2_POSN                      equ 0003h
WDTCON0_WDTPS2_POSITION                  equ 0003h
WDTCON0_WDTPS2_SIZE                      equ 0001h
WDTCON0_WDTPS2_LENGTH                    equ 0001h
WDTCON0_WDTPS2_MASK                      equ 0008h
WDTCON0_WDTPS3_POSN                      equ 0004h
WDTCON0_WDTPS3_POSITION                  equ 0004h
WDTCON0_WDTPS3_SIZE                      equ 0001h
WDTCON0_WDTPS3_LENGTH                    equ 0001h
WDTCON0_WDTPS3_MASK                      equ 0010h
WDTCON0_WDTPS4_POSN                      equ 0005h
WDTCON0_WDTPS4_POSITION                  equ 0005h
WDTCON0_WDTPS4_SIZE                      equ 0001h
WDTCON0_WDTPS4_LENGTH                    equ 0001h
WDTCON0_WDTPS4_MASK                      equ 0020h

// Register: WDTCON1
#define WDTCON1 WDTCON1
WDTCON1                                  equ 018Dh
// bitfield definitions
WDTCON1_WINDOW_POSN                      equ 0000h
WDTCON1_WINDOW_POSITION                  equ 0000h
WDTCON1_WINDOW_SIZE                      equ 0003h
WDTCON1_WINDOW_LENGTH                    equ 0003h
WDTCON1_WINDOW_MASK                      equ 0007h
WDTCON1_CS_POSN                          equ 0004h
WDTCON1_CS_POSITION                      equ 0004h
WDTCON1_CS_SIZE                          equ 0003h
WDTCON1_CS_LENGTH                        equ 0003h
WDTCON1_CS_MASK                          equ 0070h
WDTCON1_WINDOW0_POSN                     equ 0000h
WDTCON1_WINDOW0_POSITION                 equ 0000h
WDTCON1_WINDOW0_SIZE                     equ 0001h
WDTCON1_WINDOW0_LENGTH                   equ 0001h
WDTCON1_WINDOW0_MASK                     equ 0001h
WDTCON1_WINDOW1_POSN                     equ 0001h
WDTCON1_WINDOW1_POSITION                 equ 0001h
WDTCON1_WINDOW1_SIZE                     equ 0001h
WDTCON1_WINDOW1_LENGTH                   equ 0001h
WDTCON1_WINDOW1_MASK                     equ 0002h
WDTCON1_WINDOW2_POSN                     equ 0002h
WDTCON1_WINDOW2_POSITION                 equ 0002h
WDTCON1_WINDOW2_SIZE                     equ 0001h
WDTCON1_WINDOW2_LENGTH                   equ 0001h
WDTCON1_WINDOW2_MASK                     equ 0004h
WDTCON1_WDTCS_POSN                       equ 0004h
WDTCON1_WDTCS_POSITION                   equ 0004h
WDTCON1_WDTCS_SIZE                       equ 0003h
WDTCON1_WDTCS_LENGTH                     equ 0003h
WDTCON1_WDTCS_MASK                       equ 0070h
WDTCON1_WDTWINDOW_POSN                   equ 0000h
WDTCON1_WDTWINDOW_POSITION               equ 0000h
WDTCON1_WDTWINDOW_SIZE                   equ 0003h
WDTCON1_WDTWINDOW_LENGTH                 equ 0003h
WDTCON1_WDTWINDOW_MASK                   equ 0007h
WDTCON1_CS0_POSN                         equ 0004h
WDTCON1_CS0_POSITION                     equ 0004h
WDTCON1_CS0_SIZE                         equ 0001h
WDTCON1_CS0_LENGTH                       equ 0001h
WDTCON1_CS0_MASK                         equ 0010h
WDTCON1_CS1_POSN                         equ 0005h
WDTCON1_CS1_POSITION                     equ 0005h
WDTCON1_CS1_SIZE                         equ 0001h
WDTCON1_CS1_LENGTH                       equ 0001h
WDTCON1_CS1_MASK                         equ 0020h
WDTCON1_CS2_POSN                         equ 0006h
WDTCON1_CS2_POSITION                     equ 0006h
WDTCON1_CS2_SIZE                         equ 0001h
WDTCON1_CS2_LENGTH                       equ 0001h
WDTCON1_CS2_MASK                         equ 0040h
WDTCON1_WDTWINDOW0_POSN                  equ 0000h
WDTCON1_WDTWINDOW0_POSITION              equ 0000h
WDTCON1_WDTWINDOW0_SIZE                  equ 0001h
WDTCON1_WDTWINDOW0_LENGTH                equ 0001h
WDTCON1_WDTWINDOW0_MASK                  equ 0001h
WDTCON1_WDTWINDOW1_POSN                  equ 0001h
WDTCON1_WDTWINDOW1_POSITION              equ 0001h
WDTCON1_WDTWINDOW1_SIZE                  equ 0001h
WDTCON1_WDTWINDOW1_LENGTH                equ 0001h
WDTCON1_WDTWINDOW1_MASK                  equ 0002h
WDTCON1_WDTWINDOW2_POSN                  equ 0002h
WDTCON1_WDTWINDOW2_POSITION              equ 0002h
WDTCON1_WDTWINDOW2_SIZE                  equ 0001h
WDTCON1_WDTWINDOW2_LENGTH                equ 0001h
WDTCON1_WDTWINDOW2_MASK                  equ 0004h
WDTCON1_WDTCS0_POSN                      equ 0004h
WDTCON1_WDTCS0_POSITION                  equ 0004h
WDTCON1_WDTCS0_SIZE                      equ 0001h
WDTCON1_WDTCS0_LENGTH                    equ 0001h
WDTCON1_WDTCS0_MASK                      equ 0010h
WDTCON1_WDTCS1_POSN                      equ 0005h
WDTCON1_WDTCS1_POSITION                  equ 0005h
WDTCON1_WDTCS1_SIZE                      equ 0001h
WDTCON1_WDTCS1_LENGTH                    equ 0001h
WDTCON1_WDTCS1_MASK                      equ 0020h
WDTCON1_WDTCS2_POSN                      equ 0006h
WDTCON1_WDTCS2_POSITION                  equ 0006h
WDTCON1_WDTCS2_SIZE                      equ 0001h
WDTCON1_WDTCS2_LENGTH                    equ 0001h
WDTCON1_WDTCS2_MASK                      equ 0040h

// Register: WDTPSL
#define WDTPSL WDTPSL
WDTPSL                                   equ 018Eh
// bitfield definitions
WDTPSL_PSCNTL_POSN                       equ 0000h
WDTPSL_PSCNTL_POSITION                   equ 0000h
WDTPSL_PSCNTL_SIZE                       equ 0008h
WDTPSL_PSCNTL_LENGTH                     equ 0008h
WDTPSL_PSCNTL_MASK                       equ 00FFh
WDTPSL_WDTPSCNTL_POSN                    equ 0000h
WDTPSL_WDTPSCNTL_POSITION                equ 0000h
WDTPSL_WDTPSCNTL_SIZE                    equ 0008h
WDTPSL_WDTPSCNTL_LENGTH                  equ 0008h
WDTPSL_WDTPSCNTL_MASK                    equ 00FFh
WDTPSL_PSCNT0_POSN                       equ 0000h
WDTPSL_PSCNT0_POSITION                   equ 0000h
WDTPSL_PSCNT0_SIZE                       equ 0001h
WDTPSL_PSCNT0_LENGTH                     equ 0001h
WDTPSL_PSCNT0_MASK                       equ 0001h
WDTPSL_PSCNT1_POSN                       equ 0001h
WDTPSL_PSCNT1_POSITION                   equ 0001h
WDTPSL_PSCNT1_SIZE                       equ 0001h
WDTPSL_PSCNT1_LENGTH                     equ 0001h
WDTPSL_PSCNT1_MASK                       equ 0002h
WDTPSL_PSCNT2_POSN                       equ 0002h
WDTPSL_PSCNT2_POSITION                   equ 0002h
WDTPSL_PSCNT2_SIZE                       equ 0001h
WDTPSL_PSCNT2_LENGTH                     equ 0001h
WDTPSL_PSCNT2_MASK                       equ 0004h
WDTPSL_PSCNT3_POSN                       equ 0003h
WDTPSL_PSCNT3_POSITION                   equ 0003h
WDTPSL_PSCNT3_SIZE                       equ 0001h
WDTPSL_PSCNT3_LENGTH                     equ 0001h
WDTPSL_PSCNT3_MASK                       equ 0008h
WDTPSL_PSCNT4_POSN                       equ 0004h
WDTPSL_PSCNT4_POSITION                   equ 0004h
WDTPSL_PSCNT4_SIZE                       equ 0001h
WDTPSL_PSCNT4_LENGTH                     equ 0001h
WDTPSL_PSCNT4_MASK                       equ 0010h
WDTPSL_PSCNT5_POSN                       equ 0005h
WDTPSL_PSCNT5_POSITION                   equ 0005h
WDTPSL_PSCNT5_SIZE                       equ 0001h
WDTPSL_PSCNT5_LENGTH                     equ 0001h
WDTPSL_PSCNT5_MASK                       equ 0020h
WDTPSL_PSCNT6_POSN                       equ 0006h
WDTPSL_PSCNT6_POSITION                   equ 0006h
WDTPSL_PSCNT6_SIZE                       equ 0001h
WDTPSL_PSCNT6_LENGTH                     equ 0001h
WDTPSL_PSCNT6_MASK                       equ 0040h
WDTPSL_PSCNT7_POSN                       equ 0007h
WDTPSL_PSCNT7_POSITION                   equ 0007h
WDTPSL_PSCNT7_SIZE                       equ 0001h
WDTPSL_PSCNT7_LENGTH                     equ 0001h
WDTPSL_PSCNT7_MASK                       equ 0080h

