garyPenhook/PIC-Assembler/device_includes/pic16f17554.inc
// Register: ADCON0
#define ADCON0 ADCON0
ADCON0                                   equ 01D26h
// bitfield definitions
ADCON0_GO_POSN                           equ 0000h
ADCON0_GO_POSITION                       equ 0000h
ADCON0_GO_SIZE                           equ 0001h
ADCON0_GO_LENGTH                         equ 0001h
ADCON0_GO_MASK                           equ 0001h
ADCON0_IC_POSN                           equ 0001h
ADCON0_IC_POSITION                       equ 0001h
ADCON0_IC_SIZE                           equ 0001h
ADCON0_IC_LENGTH                         equ 0001h
ADCON0_IC_MASK                           equ 0002h
ADCON0_FM_POSN                           equ 0002h
ADCON0_FM_POSITION                       equ 0002h
ADCON0_FM_SIZE                           equ 0002h
ADCON0_FM_LENGTH                         equ 0002h
ADCON0_FM_MASK                           equ 000Ch
ADCON0_CONT_POSN                         equ 0006h
ADCON0_CONT_POSITION                     equ 0006h
ADCON0_CONT_SIZE                         equ 0001h
ADCON0_CONT_LENGTH                       equ 0001h
ADCON0_CONT_MASK                         equ 0040h
ADCON0_ON_POSN                           equ 0007h
ADCON0_ON_POSITION                       equ 0007h
ADCON0_ON_SIZE                           equ 0001h
ADCON0_ON_LENGTH                         equ 0001h
ADCON0_ON_MASK                           equ 0080h
ADCON0_ADGO_POSN                         equ 0000h
ADCON0_ADGO_POSITION                     equ 0000h
ADCON0_ADGO_SIZE                         equ 0001h
ADCON0_ADGO_LENGTH                       equ 0001h
ADCON0_ADGO_MASK                         equ 0001h
ADCON0_ADIC_POSN                         equ 0001h
ADCON0_ADIC_POSITION                     equ 0001h
ADCON0_ADIC_SIZE                         equ 0001h
ADCON0_ADIC_LENGTH                       equ 0001h
ADCON0_ADIC_MASK                         equ 0002h
ADCON0_ADFM_POSN                         equ 0002h
ADCON0_ADFM_POSITION                     equ 0002h
ADCON0_ADFM_SIZE                         equ 0002h
ADCON0_ADFM_LENGTH                       equ 0002h
ADCON0_ADFM_MASK                         equ 000Ch
ADCON0_ADCONT_POSN                       equ 0006h
ADCON0_ADCONT_POSITION                   equ 0006h
ADCON0_ADCONT_SIZE                       equ 0001h
ADCON0_ADCONT_LENGTH                     equ 0001h
ADCON0_ADCONT_MASK                       equ 0040h
ADCON0_ADON_POSN                         equ 0007h
ADCON0_ADON_POSITION                     equ 0007h
ADCON0_ADON_SIZE                         equ 0001h
ADCON0_ADON_LENGTH                       equ 0001h
ADCON0_ADON_MASK                         equ 0080h
ADCON0_DONE_POSN                         equ 0000h
ADCON0_DONE_POSITION                     equ 0000h
ADCON0_DONE_SIZE                         equ 0001h
ADCON0_DONE_LENGTH                       equ 0001h
ADCON0_DONE_MASK                         equ 0001h
ADCON0_FM0_POSN                          equ 0002h
ADCON0_FM0_POSITION                      equ 0002h
ADCON0_FM0_SIZE                          equ 0001h
ADCON0_FM0_LENGTH                        equ 0001h
ADCON0_FM0_MASK                          equ 0004h
ADCON0_FM1_POSN                          equ 0003h
ADCON0_FM1_POSITION                      equ 0003h
ADCON0_FM1_SIZE                          equ 0001h
ADCON0_FM1_LENGTH                        equ 0001h
ADCON0_FM1_MASK                          equ 0008h
ADCON0_GO_nDONE_POSN                     equ 0000h
ADCON0_GO_nDONE_POSITION                 equ 0000h
ADCON0_GO_nDONE_SIZE                     equ 0001h
ADCON0_GO_nDONE_LENGTH                   equ 0001h
ADCON0_GO_nDONE_MASK                     equ 0001h
ADCON0_ADFM0_POSN                        equ 0002h
ADCON0_ADFM0_POSITION                    equ 0002h
ADCON0_ADFM0_SIZE                        equ 0001h
ADCON0_ADFM0_LENGTH                      equ 0001h
ADCON0_ADFM0_MASK                        equ 0004h
ADCON0_ADFM1_POSN                        equ 0003h
ADCON0_ADFM1_POSITION                    equ 0003h
ADCON0_ADFM1_SIZE                        equ 0001h
ADCON0_ADFM1_LENGTH                      equ 0001h
ADCON0_ADFM1_MASK                        equ 0008h

// Register: ADCON1
#define ADCON1 ADCON1
ADCON1                                   equ 01D27h
// bitfield definitions
ADCON1_DSEN_POSN                         equ 0000h
ADCON1_DSEN_POSITION                     equ 0000h
ADCON1_DSEN_SIZE                         equ 0001h
ADCON1_DSEN_LENGTH                       equ 0001h
ADCON1_DSEN_MASK                         equ 0001h
ADCON1_PCSC_POSN                         equ 0001h
ADCON1_PCSC_POSITION                     equ 0001h
ADCON1_PCSC_SIZE                         equ 0001h
ADCON1_PCSC_LENGTH                       equ 0001h
ADCON1_PCSC_MASK                         equ 0002h
ADCON1_GPOL_POSN                         equ 0005h
ADCON1_GPOL_POSITION                     equ 0005h
ADCON1_GPOL_SIZE                         equ 0001h
ADCON1_GPOL_LENGTH                       equ 0001h
ADCON1_GPOL_MASK                         equ 0020h
ADCON1_IPEN_POSN                         equ 0006h
ADCON1_IPEN_POSITION                     equ 0006h
ADCON1_IPEN_SIZE                         equ 0001h
ADCON1_IPEN_LENGTH                       equ 0001h
ADCON1_IPEN_MASK                         equ 0040h
ADCON1_PPOL_POSN                         equ 0007h
ADCON1_PPOL_POSITION                     equ 0007h
ADCON1_PPOL_SIZE                         equ 0001h
ADCON1_PPOL_LENGTH                       equ 0001h
ADCON1_PPOL_MASK                         equ 0080h
ADCON1_ADDSEN_POSN                       equ 0000h
ADCON1_ADDSEN_POSITION                   equ 0000h
ADCON1_ADDSEN_SIZE                       equ 0001h
ADCON1_ADDSEN_LENGTH                     equ 0001h
ADCON1_ADDSEN_MASK                       equ 0001h
ADCON1_ADPCSC_POSN                       equ 0001h
ADCON1_ADPCSC_POSITION                   equ 0001h
ADCON1_ADPCSC_SIZE                       equ 0001h
ADCON1_ADPCSC_LENGTH                     equ 0001h
ADCON1_ADPCSC_MASK                       equ 0002h
ADCON1_ADGPOL_POSN                       equ 0005h
ADCON1_ADGPOL_POSITION                   equ 0005h
ADCON1_ADGPOL_SIZE                       equ 0001h
ADCON1_ADGPOL_LENGTH                     equ 0001h
ADCON1_ADGPOL_MASK                       equ 0020h
ADCON1_ADIPEN_POSN                       equ 0006h
ADCON1_ADIPEN_POSITION                   equ 0006h
ADCON1_ADIPEN_SIZE                       equ 0001h
ADCON1_ADIPEN_LENGTH                     equ 0001h
ADCON1_ADIPEN_MASK                       equ 0040h
ADCON1_ADPPOL_POSN                       equ 0007h
ADCON1_ADPPOL_POSITION                   equ 0007h
ADCON1_ADPPOL_SIZE                       equ 0001h
ADCON1_ADPPOL_LENGTH                     equ 0001h
ADCON1_ADPPOL_MASK                       equ 0080h

// Register: ADCON2
#define ADCON2 ADCON2
ADCON2                                   equ 01D28h
// bitfield definitions
ADCON2_MODE_POSN                         equ 0000h
ADCON2_MODE_POSITION                     equ 0000h
ADCON2_MODE_SIZE                         equ 0003h
ADCON2_MODE_LENGTH                       equ 0003h
ADCON2_MODE_MASK                         equ 0007h
ADCON2_ACLR_POSN                         equ 0003h
ADCON2_ACLR_POSITION                     equ 0003h
ADCON2_ACLR_SIZE                         equ 0001h
ADCON2_ACLR_LENGTH                       equ 0001h
ADCON2_ACLR_MASK                         equ 0008h
ADCON2_CRS_POSN                          equ 0004h
ADCON2_CRS_POSITION                      equ 0004h
ADCON2_CRS_SIZE                          equ 0003h
ADCON2_CRS_LENGTH                        equ 0003h
ADCON2_CRS_MASK                          equ 0070h
ADCON2_PSIS_POSN                         equ 0007h
ADCON2_PSIS_POSITION                     equ 0007h
ADCON2_PSIS_SIZE                         equ 0001h
ADCON2_PSIS_LENGTH                       equ 0001h
ADCON2_PSIS_MASK                         equ 0080h
ADCON2_ADMD0_POSN                        equ 0000h
ADCON2_ADMD0_POSITION                    equ 0000h
ADCON2_ADMD0_SIZE                        equ 0001h
ADCON2_ADMD0_LENGTH                      equ 0001h
ADCON2_ADMD0_MASK                        equ 0001h
ADCON2_ADMD1_POSN                        equ 0001h
ADCON2_ADMD1_POSITION                    equ 0001h
ADCON2_ADMD1_SIZE                        equ 0001h
ADCON2_ADMD1_LENGTH                      equ 0001h
ADCON2_ADMD1_MASK                        equ 0002h
ADCON2_ADMD2_POSN                        equ 0002h
ADCON2_ADMD2_POSITION                    equ 0002h
ADCON2_ADMD2_SIZE                        equ 0001h
ADCON2_ADMD2_LENGTH                      equ 0001h
ADCON2_ADMD2_MASK                        equ 0004h
ADCON2_ADACLR_POSN                       equ 0003h
ADCON2_ADACLR_POSITION                   equ 0003h
ADCON2_ADACLR_SIZE                       equ 0001h
ADCON2_ADACLR_LENGTH                     equ 0001h
ADCON2_ADACLR_MASK                       equ 0008h
ADCON2_ADCRS0_POSN                       equ 0004h
ADCON2_ADCRS0_POSITION                   equ 0004h
ADCON2_ADCRS0_SIZE                       equ 0001h
ADCON2_ADCRS0_LENGTH                     equ 0001h
ADCON2_ADCRS0_MASK                       equ 0010h
ADCON2_ADCRS1_POSN                       equ 0005h
ADCON2_ADCRS1_POSITION                   equ 0005h
ADCON2_ADCRS1_SIZE                       equ 0001h
ADCON2_ADCRS1_LENGTH                     equ 0001h
ADCON2_ADCRS1_MASK                       equ 0020h
ADCON2_ADCRS2_POSN                       equ 0006h
ADCON2_ADCRS2_POSITION                   equ 0006h
ADCON2_ADCRS2_SIZE                       equ 0001h
ADCON2_ADCRS2_LENGTH                     equ 0001h
ADCON2_ADCRS2_MASK                       equ 0040h
ADCON2_ADPSIS_POSN                       equ 0007h
ADCON2_ADPSIS_POSITION                   equ 0007h
ADCON2_ADPSIS_SIZE                       equ 0001h
ADCON2_ADPSIS_LENGTH                     equ 0001h
ADCON2_ADPSIS_MASK                       equ 0080h
ADCON2_ADMD_POSN                         equ 0000h
ADCON2_ADMD_POSITION                     equ 0000h
ADCON2_ADMD_SIZE                         equ 0003h
ADCON2_ADMD_LENGTH                       equ 0003h
ADCON2_ADMD_MASK                         equ 0007h
ADCON2_ADCRS_POSN                        equ 0004h
ADCON2_ADCRS_POSITION                    equ 0004h
ADCON2_ADCRS_SIZE                        equ 0003h
ADCON2_ADCRS_LENGTH                      equ 0003h
ADCON2_ADCRS_MASK                        equ 0070h
ADCON2_MODE0_POSN                        equ 0000h
ADCON2_MODE0_POSITION                    equ 0000h
ADCON2_MODE0_SIZE                        equ 0001h
ADCON2_MODE0_LENGTH                      equ 0001h
ADCON2_MODE0_MASK                        equ 0001h
ADCON2_MODE1_POSN                        equ 0001h
ADCON2_MODE1_POSITION                    equ 0001h
ADCON2_MODE1_SIZE                        equ 0001h
ADCON2_MODE1_LENGTH                      equ 0001h
ADCON2_MODE1_MASK                        equ 0002h
ADCON2_MODE2_POSN                        equ 0002h
ADCON2_MODE2_POSITION                    equ 0002h
ADCON2_MODE2_SIZE                        equ 0001h
ADCON2_MODE2_LENGTH                      equ 0001h
ADCON2_MODE2_MASK                        equ 0004h
ADCON2_CRS0_POSN                         equ 0004h
ADCON2_CRS0_POSITION                     equ 0004h
ADCON2_CRS0_SIZE                         equ 0001h
ADCON2_CRS0_LENGTH                       equ 0001h
ADCON2_CRS0_MASK                         equ 0010h
ADCON2_CRS1_POSN                         equ 0005h
ADCON2_CRS1_POSITION                     equ 0005h
ADCON2_CRS1_SIZE                         equ 0001h
ADCON2_CRS1_LENGTH                       equ 0001h
ADCON2_CRS1_MASK                         equ 0020h
ADCON2_CRS2_POSN                         equ 0006h
ADCON2_CRS2_POSITION                     equ 0006h
ADCON2_CRS2_SIZE                         equ 0001h
ADCON2_CRS2_LENGTH                       equ 0001h
ADCON2_CRS2_MASK                         equ 0040h
ADCON2_MD_POSN                           equ 0000h
ADCON2_MD_POSITION                       equ 0000h
ADCON2_MD_SIZE                           equ 0003h
ADCON2_MD_LENGTH                         equ 0003h
ADCON2_MD_MASK                           equ 0007h
ADCON2_MD0_POSN                          equ 0000h
ADCON2_MD0_POSITION                      equ 0000h
ADCON2_MD0_SIZE                          equ 0001h
ADCON2_MD0_LENGTH                        equ 0001h
ADCON2_MD0_MASK                          equ 0001h
ADCON2_MD1_POSN                          equ 0001h
ADCON2_MD1_POSITION                      equ 0001h
ADCON2_MD1_SIZE                          equ 0001h
ADCON2_MD1_LENGTH                        equ 0001h
ADCON2_MD1_MASK                          equ 0002h
ADCON2_MD2_POSN                          equ 0002h
ADCON2_MD2_POSITION                      equ 0002h
ADCON2_MD2_SIZE                          equ 0001h
ADCON2_MD2_LENGTH                        equ 0001h
ADCON2_MD2_MASK                          equ 0004h
ADCON2_ADMODE_POSN                       equ 0000h
ADCON2_ADMODE_POSITION                   equ 0000h
ADCON2_ADMODE_SIZE                       equ 0003h
ADCON2_ADMODE_LENGTH                     equ 0003h
ADCON2_ADMODE_MASK                       equ 0007h

// Register: ADCON3
#define ADCON3 ADCON3
ADCON3                                   equ 01D29h
// bitfield definitions
ADCON3_TMD_POSN                          equ 0000h
ADCON3_TMD_POSITION                      equ 0000h
ADCON3_TMD_SIZE                          equ 0003h
ADCON3_TMD_LENGTH                        equ 0003h
ADCON3_TMD_MASK                          equ 0007h
ADCON3_SOI_POSN                          equ 0003h
ADCON3_SOI_POSITION                      equ 0003h
ADCON3_SOI_SIZE                          equ 0001h
ADCON3_SOI_LENGTH                        equ 0001h
ADCON3_SOI_MASK                          equ 0008h
ADCON3_CALC_POSN                         equ 0004h
ADCON3_CALC_POSITION                     equ 0004h
ADCON3_CALC_SIZE                         equ 0003h
ADCON3_CALC_LENGTH                       equ 0003h
ADCON3_CALC_MASK                         equ 0070h
ADCON3_ADTMD0_POSN                       equ 0000h
ADCON3_ADTMD0_POSITION                   equ 0000h
ADCON3_ADTMD0_SIZE                       equ 0001h
ADCON3_ADTMD0_LENGTH                     equ 0001h
ADCON3_ADTMD0_MASK                       equ 0001h
ADCON3_ADTMD1_POSN                       equ 0001h
ADCON3_ADTMD1_POSITION                   equ 0001h
ADCON3_ADTMD1_SIZE                       equ 0001h
ADCON3_ADTMD1_LENGTH                     equ 0001h
ADCON3_ADTMD1_MASK                       equ 0002h
ADCON3_ADTMD2_POSN                       equ 0002h
ADCON3_ADTMD2_POSITION                   equ 0002h
ADCON3_ADTMD2_SIZE                       equ 0001h
ADCON3_ADTMD2_LENGTH                     equ 0001h
ADCON3_ADTMD2_MASK                       equ 0004h
ADCON3_ADSOI_POSN                        equ 0003h
ADCON3_ADSOI_POSITION                    equ 0003h
ADCON3_ADSOI_SIZE                        equ 0001h
ADCON3_ADSOI_LENGTH                      equ 0001h
ADCON3_ADSOI_MASK                        equ 0008h
ADCON3_ADCALC0_POSN                      equ 0004h
ADCON3_ADCALC0_POSITION                  equ 0004h
ADCON3_ADCALC0_SIZE                      equ 0001h
ADCON3_ADCALC0_LENGTH                    equ 0001h
ADCON3_ADCALC0_MASK                      equ 0010h
ADCON3_ADCALC1_POSN                      equ 0005h
ADCON3_ADCALC1_POSITION                  equ 0005h
ADCON3_ADCALC1_SIZE                      equ 0001h
ADCON3_ADCALC1_LENGTH                    equ 0001h
ADCON3_ADCALC1_MASK                      equ 0020h
ADCON3_ADCALC2_POSN                      equ 0006h
ADCON3_ADCALC2_POSITION                  equ 0006h
ADCON3_ADCALC2_SIZE                      equ 0001h
ADCON3_ADCALC2_LENGTH                    equ 0001h
ADCON3_ADCALC2_MASK                      equ 0040h
ADCON3_ADTMD_POSN                        equ 0000h
ADCON3_ADTMD_POSITION                    equ 0000h
ADCON3_ADTMD_SIZE                        equ 0003h
ADCON3_ADTMD_LENGTH                      equ 0003h
ADCON3_ADTMD_MASK                        equ 0007h
ADCON3_ADCALC_POSN                       equ 0004h
ADCON3_ADCALC_POSITION                   equ 0004h
ADCON3_ADCALC_SIZE                       equ 0003h
ADCON3_ADCALC_LENGTH                     equ 0003h
ADCON3_ADCALC_MASK                       equ 0070h
ADCON3_TMD0_POSN                         equ 0000h
ADCON3_TMD0_POSITION                     equ 0000h
ADCON3_TMD0_SIZE                         equ 0001h
ADCON3_TMD0_LENGTH                       equ 0001h
ADCON3_TMD0_MASK                         equ 0001h
ADCON3_TMD1_POSN                         equ 0001h
ADCON3_TMD1_POSITION                     equ 0001h
ADCON3_TMD1_SIZE                         equ 0001h
ADCON3_TMD1_LENGTH                       equ 0001h
ADCON3_TMD1_MASK                         equ 0002h
ADCON3_TMD2_POSN                         equ 0002h
ADCON3_TMD2_POSITION                     equ 0002h
ADCON3_TMD2_SIZE                         equ 0001h
ADCON3_TMD2_LENGTH                       equ 0001h
ADCON3_TMD2_MASK                         equ 0004h
ADCON3_CALC0_POSN                        equ 0004h
ADCON3_CALC0_POSITION                    equ 0004h
ADCON3_CALC0_SIZE                        equ 0001h
ADCON3_CALC0_LENGTH                      equ 0001h
ADCON3_CALC0_MASK                        equ 0010h
ADCON3_CALC1_POSN                        equ 0005h
ADCON3_CALC1_POSITION                    equ 0005h
ADCON3_CALC1_SIZE                        equ 0001h
ADCON3_CALC1_LENGTH                      equ 0001h
ADCON3_CALC1_MASK                        equ 0020h
ADCON3_CALC2_POSN                        equ 0006h
ADCON3_CALC2_POSITION                    equ 0006h
ADCON3_CALC2_SIZE                        equ 0001h
ADCON3_CALC2_LENGTH                      equ 0001h
ADCON3_CALC2_MASK                        equ 0040h

// Register: ADSTAT
#define ADSTAT ADSTAT
ADSTAT                                   equ 01D2Ah
// bitfield definitions
ADSTAT_STAT_POSN                         equ 0000h
ADSTAT_STAT_POSITION                     equ 0000h
ADSTAT_STAT_SIZE                         equ 0003h
ADSTAT_STAT_LENGTH                       equ 0003h
ADSTAT_STAT_MASK                         equ 0007h
ADSTAT_MATH_POSN                         equ 0004h
ADSTAT_MATH_POSITION                     equ 0004h
ADSTAT_MATH_SIZE                         equ 0001h
ADSTAT_MATH_LENGTH                       equ 0001h
ADSTAT_MATH_MASK                         equ 0010h
ADSTAT_LTHR_POSN                         equ 0005h
ADSTAT_LTHR_POSITION                     equ 0005h
ADSTAT_LTHR_SIZE                         equ 0001h
ADSTAT_LTHR_LENGTH                       equ 0001h
ADSTAT_LTHR_MASK                         equ 0020h
ADSTAT_UTHR_POSN                         equ 0006h
ADSTAT_UTHR_POSITION                     equ 0006h
ADSTAT_UTHR_SIZE                         equ 0001h
ADSTAT_UTHR_LENGTH                       equ 0001h
ADSTAT_UTHR_MASK                         equ 0040h
ADSTAT_AOV_POSN                          equ 0007h
ADSTAT_AOV_POSITION                      equ 0007h
ADSTAT_AOV_SIZE                          equ 0001h
ADSTAT_AOV_LENGTH                        equ 0001h
ADSTAT_AOV_MASK                          equ 0080h
ADSTAT_ADSTAT0_POSN                      equ 0000h
ADSTAT_ADSTAT0_POSITION                  equ 0000h
ADSTAT_ADSTAT0_SIZE                      equ 0001h
ADSTAT_ADSTAT0_LENGTH                    equ 0001h
ADSTAT_ADSTAT0_MASK                      equ 0001h
ADSTAT_ADSTAT1_POSN                      equ 0001h
ADSTAT_ADSTAT1_POSITION                  equ 0001h
ADSTAT_ADSTAT1_SIZE                      equ 0001h
ADSTAT_ADSTAT1_LENGTH                    equ 0001h
ADSTAT_ADSTAT1_MASK                      equ 0002h
ADSTAT_ADSTAT2_POSN                      equ 0002h
ADSTAT_ADSTAT2_POSITION                  equ 0002h
ADSTAT_ADSTAT2_SIZE                      equ 0001h
ADSTAT_ADSTAT2_LENGTH                    equ 0001h
ADSTAT_ADSTAT2_MASK                      equ 0004h
ADSTAT_ADMATH_POSN                       equ 0004h
ADSTAT_ADMATH_POSITION                   equ 0004h
ADSTAT_ADMATH_SIZE                       equ 0001h
ADSTAT_ADMATH_LENGTH                     equ 0001h
ADSTAT_ADMATH_MASK                       equ 0010h
ADSTAT_ADLTHR_POSN                       equ 0005h
ADSTAT_ADLTHR_POSITION                   equ 0005h
ADSTAT_ADLTHR_SIZE                       equ 0001h
ADSTAT_ADLTHR_LENGTH                     equ 0001h
ADSTAT_ADLTHR_MASK                       equ 0020h
ADSTAT_ADUTHR_POSN                       equ 0006h
ADSTAT_ADUTHR_POSITION                   equ 0006h
ADSTAT_ADUTHR_SIZE                       equ 0001h
ADSTAT_ADUTHR_LENGTH                     equ 0001h
ADSTAT_ADUTHR_MASK                       equ 0040h
ADSTAT_ADAOV_POSN                        equ 0007h
ADSTAT_ADAOV_POSITION                    equ 0007h
ADSTAT_ADAOV_SIZE                        equ 0001h
ADSTAT_ADAOV_LENGTH                      equ 0001h
ADSTAT_ADAOV_MASK                        equ 0080h
ADSTAT_ADSTAT_POSN                       equ 0000h
ADSTAT_ADSTAT_POSITION                   equ 0000h
ADSTAT_ADSTAT_SIZE                       equ 0003h
ADSTAT_ADSTAT_LENGTH                     equ 0003h
ADSTAT_ADSTAT_MASK                       equ 0007h
ADSTAT_ADOV_POSN                         equ 0007h
ADSTAT_ADOV_POSITION                     equ 0007h
ADSTAT_ADOV_SIZE                         equ 0001h
ADSTAT_ADOV_LENGTH                       equ 0001h
ADSTAT_ADOV_MASK                         equ 0080h
ADSTAT_STAT0_POSN                        equ 0000h
ADSTAT_STAT0_POSITION                    equ 0000h
ADSTAT_STAT0_SIZE                        equ 0001h
ADSTAT_STAT0_LENGTH                      equ 0001h
ADSTAT_STAT0_MASK                        equ 0001h
ADSTAT_STAT1_POSN                        equ 0001h
ADSTAT_STAT1_POSITION                    equ 0001h
ADSTAT_STAT1_SIZE                        equ 0001h
ADSTAT_STAT1_LENGTH                      equ 0001h
ADSTAT_STAT1_MASK                        equ 0002h
ADSTAT_STAT2_POSN                        equ 0002h
ADSTAT_STAT2_POSITION                    equ 0002h
ADSTAT_STAT2_SIZE                        equ 0001h
ADSTAT_STAT2_LENGTH                      equ 0001h
ADSTAT_STAT2_MASK                        equ 0004h

