garyPenhook/PIC-Assembler/device_includes/pic16f17554.inc
// Register: ADREF
#define ADREF ADREF
ADREF                                    equ 01D2Bh
// bitfield definitions
ADREF_PREF_POSN                          equ 0000h
ADREF_PREF_POSITION                      equ 0000h
ADREF_PREF_SIZE                          equ 0004h
ADREF_PREF_LENGTH                        equ 0004h
ADREF_PREF_MASK                          equ 000Fh
ADREF_NREF_POSN                          equ 0004h
ADREF_NREF_POSITION                      equ 0004h
ADREF_NREF_SIZE                          equ 0004h
ADREF_NREF_LENGTH                        equ 0004h
ADREF_NREF_MASK                          equ 00F0h
ADREF_ADPREF_POSN                        equ 0000h
ADREF_ADPREF_POSITION                    equ 0000h
ADREF_ADPREF_SIZE                        equ 0004h
ADREF_ADPREF_LENGTH                      equ 0004h
ADREF_ADPREF_MASK                        equ 000Fh
ADREF_ADNREF_POSN                        equ 0004h
ADREF_ADNREF_POSITION                    equ 0004h
ADREF_ADNREF_SIZE                        equ 0004h
ADREF_ADNREF_LENGTH                      equ 0004h
ADREF_ADNREF_MASK                        equ 00F0h
ADREF_PREF0_POSN                         equ 0000h
ADREF_PREF0_POSITION                     equ 0000h
ADREF_PREF0_SIZE                         equ 0001h
ADREF_PREF0_LENGTH                       equ 0001h
ADREF_PREF0_MASK                         equ 0001h
ADREF_PREF1_POSN                         equ 0001h
ADREF_PREF1_POSITION                     equ 0001h
ADREF_PREF1_SIZE                         equ 0001h
ADREF_PREF1_LENGTH                       equ 0001h
ADREF_PREF1_MASK                         equ 0002h
ADREF_NREF0_POSN                         equ 0004h
ADREF_NREF0_POSITION                     equ 0004h
ADREF_NREF0_SIZE                         equ 0001h
ADREF_NREF0_LENGTH                       equ 0001h
ADREF_NREF0_MASK                         equ 0010h
ADREF_ADPREF0_POSN                       equ 0000h
ADREF_ADPREF0_POSITION                   equ 0000h
ADREF_ADPREF0_SIZE                       equ 0001h
ADREF_ADPREF0_LENGTH                     equ 0001h
ADREF_ADPREF0_MASK                       equ 0001h
ADREF_ADPREF1_POSN                       equ 0001h
ADREF_ADPREF1_POSITION                   equ 0001h
ADREF_ADPREF1_SIZE                       equ 0001h
ADREF_ADPREF1_LENGTH                     equ 0001h
ADREF_ADPREF1_MASK                       equ 0002h
ADREF_ADNREF0_POSN                       equ 0004h
ADREF_ADNREF0_POSITION                   equ 0004h
ADREF_ADNREF0_SIZE                       equ 0001h
ADREF_ADNREF0_LENGTH                     equ 0001h
ADREF_ADNREF0_MASK                       equ 0010h

// Register: ADACT
#define ADACT ADACT
ADACT                                    equ 01D2Ch
// bitfield definitions
ADACT_ACT_POSN                           equ 0000h
ADACT_ACT_POSITION                       equ 0000h
ADACT_ACT_SIZE                           equ 0006h
ADACT_ACT_LENGTH                         equ 0006h
ADACT_ACT_MASK                           equ 003Fh
ADACT_ADACT0_POSN                        equ 0000h
ADACT_ADACT0_POSITION                    equ 0000h
ADACT_ADACT0_SIZE                        equ 0001h
ADACT_ADACT0_LENGTH                      equ 0001h
ADACT_ADACT0_MASK                        equ 0001h
ADACT_ADACT1_POSN                        equ 0001h
ADACT_ADACT1_POSITION                    equ 0001h
ADACT_ADACT1_SIZE                        equ 0001h
ADACT_ADACT1_LENGTH                      equ 0001h
ADACT_ADACT1_MASK                        equ 0002h
ADACT_ADACT2_POSN                        equ 0002h
ADACT_ADACT2_POSITION                    equ 0002h
ADACT_ADACT2_SIZE                        equ 0001h
ADACT_ADACT2_LENGTH                      equ 0001h
ADACT_ADACT2_MASK                        equ 0004h
ADACT_ADACT3_POSN                        equ 0003h
ADACT_ADACT3_POSITION                    equ 0003h
ADACT_ADACT3_SIZE                        equ 0001h
ADACT_ADACT3_LENGTH                      equ 0001h
ADACT_ADACT3_MASK                        equ 0008h
ADACT_ADACT4_POSN                        equ 0004h
ADACT_ADACT4_POSITION                    equ 0004h
ADACT_ADACT4_SIZE                        equ 0001h
ADACT_ADACT4_LENGTH                      equ 0001h
ADACT_ADACT4_MASK                        equ 0010h
ADACT_ADACT5_POSN                        equ 0005h
ADACT_ADACT5_POSITION                    equ 0005h
ADACT_ADACT5_SIZE                        equ 0001h
ADACT_ADACT5_LENGTH                      equ 0001h
ADACT_ADACT5_MASK                        equ 0020h
ADACT_ADACT_POSN                         equ 0000h
ADACT_ADACT_POSITION                     equ 0000h
ADACT_ADACT_SIZE                         equ 0006h
ADACT_ADACT_LENGTH                       equ 0006h
ADACT_ADACT_MASK                         equ 003Fh
ADACT_ACT0_POSN                          equ 0000h
ADACT_ACT0_POSITION                      equ 0000h
ADACT_ACT0_SIZE                          equ 0001h
ADACT_ACT0_LENGTH                        equ 0001h
ADACT_ACT0_MASK                          equ 0001h
ADACT_ACT1_POSN                          equ 0001h
ADACT_ACT1_POSITION                      equ 0001h
ADACT_ACT1_SIZE                          equ 0001h
ADACT_ACT1_LENGTH                        equ 0001h
ADACT_ACT1_MASK                          equ 0002h
ADACT_ACT2_POSN                          equ 0002h
ADACT_ACT2_POSITION                      equ 0002h
ADACT_ACT2_SIZE                          equ 0001h
ADACT_ACT2_LENGTH                        equ 0001h
ADACT_ACT2_MASK                          equ 0004h
ADACT_ACT3_POSN                          equ 0003h
ADACT_ACT3_POSITION                      equ 0003h
ADACT_ACT3_SIZE                          equ 0001h
ADACT_ACT3_LENGTH                        equ 0001h
ADACT_ACT3_MASK                          equ 0008h
ADACT_ACT4_POSN                          equ 0004h
ADACT_ACT4_POSITION                      equ 0004h
ADACT_ACT4_SIZE                          equ 0001h
ADACT_ACT4_LENGTH                        equ 0001h
ADACT_ACT4_MASK                          equ 0010h
ADACT_ACT5_POSN                          equ 0005h
ADACT_ACT5_POSITION                      equ 0005h
ADACT_ACT5_SIZE                          equ 0001h
ADACT_ACT5_LENGTH                        equ 0001h
ADACT_ACT5_MASK                          equ 0020h

