garyPenhook/PIC-Assembler/device_includes/pic16f17554.inc
// Register: PORTWIN1
#define PORTWIN1 PORTWIN1
PORTWIN1                                 equ 01F25h
// bitfield definitions
PORTWIN1_IN_POSN                         equ 0000h
PORTWIN1_IN_POSITION                     equ 0000h
PORTWIN1_IN_SIZE                         equ 0008h
PORTWIN1_IN_LENGTH                       equ 0008h
PORTWIN1_IN_MASK                         equ 00FFh
PORTWIN1_IN0_POSN                        equ 0000h
PORTWIN1_IN0_POSITION                    equ 0000h
PORTWIN1_IN0_SIZE                        equ 0001h
PORTWIN1_IN0_LENGTH                      equ 0001h
PORTWIN1_IN0_MASK                        equ 0001h
PORTWIN1_IN1_POSN                        equ 0001h
PORTWIN1_IN1_POSITION                    equ 0001h
PORTWIN1_IN1_SIZE                        equ 0001h
PORTWIN1_IN1_LENGTH                      equ 0001h
PORTWIN1_IN1_MASK                        equ 0002h
PORTWIN1_IN2_POSN                        equ 0002h
PORTWIN1_IN2_POSITION                    equ 0002h
PORTWIN1_IN2_SIZE                        equ 0001h
PORTWIN1_IN2_LENGTH                      equ 0001h
PORTWIN1_IN2_MASK                        equ 0004h
PORTWIN1_IN3_POSN                        equ 0003h
PORTWIN1_IN3_POSITION                    equ 0003h
PORTWIN1_IN3_SIZE                        equ 0001h
PORTWIN1_IN3_LENGTH                      equ 0001h
PORTWIN1_IN3_MASK                        equ 0008h

// Register: PORTWIN2
#define PORTWIN2 PORTWIN2
PORTWIN2                                 equ 01F26h
// bitfield definitions
PORTWIN2_IN_POSN                         equ 0000h
PORTWIN2_IN_POSITION                     equ 0000h
PORTWIN2_IN_SIZE                         equ 0008h
PORTWIN2_IN_LENGTH                       equ 0008h
PORTWIN2_IN_MASK                         equ 00FFh
PORTWIN2_IN0_POSN                        equ 0000h
PORTWIN2_IN0_POSITION                    equ 0000h
PORTWIN2_IN0_SIZE                        equ 0001h
PORTWIN2_IN0_LENGTH                      equ 0001h
PORTWIN2_IN0_MASK                        equ 0001h
PORTWIN2_IN1_POSN                        equ 0001h
PORTWIN2_IN1_POSITION                    equ 0001h
PORTWIN2_IN1_SIZE                        equ 0001h
PORTWIN2_IN1_LENGTH                      equ 0001h
PORTWIN2_IN1_MASK                        equ 0002h
PORTWIN2_IN2_POSN                        equ 0002h
PORTWIN2_IN2_POSITION                    equ 0002h
PORTWIN2_IN2_SIZE                        equ 0001h
PORTWIN2_IN2_LENGTH                      equ 0001h
PORTWIN2_IN2_MASK                        equ 0004h
PORTWIN2_IN3_POSN                        equ 0003h
PORTWIN2_IN3_POSITION                    equ 0003h
PORTWIN2_IN3_SIZE                        equ 0001h
PORTWIN2_IN3_LENGTH                      equ 0001h
PORTWIN2_IN3_MASK                        equ 0008h

// Register: PORTWIN3
#define PORTWIN3 PORTWIN3
PORTWIN3                                 equ 01F27h
// bitfield definitions
PORTWIN3_IN_POSN                         equ 0000h
PORTWIN3_IN_POSITION                     equ 0000h
PORTWIN3_IN_SIZE                         equ 0008h
PORTWIN3_IN_LENGTH                       equ 0008h
PORTWIN3_IN_MASK                         equ 00FFh
PORTWIN3_IN0_POSN                        equ 0000h
PORTWIN3_IN0_POSITION                    equ 0000h
PORTWIN3_IN0_SIZE                        equ 0001h
PORTWIN3_IN0_LENGTH                      equ 0001h
PORTWIN3_IN0_MASK                        equ 0001h
PORTWIN3_IN1_POSN                        equ 0001h
PORTWIN3_IN1_POSITION                    equ 0001h
PORTWIN3_IN1_SIZE                        equ 0001h
PORTWIN3_IN1_LENGTH                      equ 0001h
PORTWIN3_IN1_MASK                        equ 0002h
PORTWIN3_IN2_POSN                        equ 0002h
PORTWIN3_IN2_POSITION                    equ 0002h
PORTWIN3_IN2_SIZE                        equ 0001h
PORTWIN3_IN2_LENGTH                      equ 0001h
PORTWIN3_IN2_MASK                        equ 0004h
PORTWIN3_IN3_POSN                        equ 0003h
PORTWIN3_IN3_POSITION                    equ 0003h
PORTWIN3_IN3_SIZE                        equ 0001h
PORTWIN3_IN3_LENGTH                      equ 0001h
PORTWIN3_IN3_MASK                        equ 0008h

// Register: PORTWIN4
#define PORTWIN4 PORTWIN4
PORTWIN4                                 equ 01F28h
// bitfield definitions
PORTWIN4_IN_POSN                         equ 0000h
PORTWIN4_IN_POSITION                     equ 0000h
PORTWIN4_IN_SIZE                         equ 0008h
PORTWIN4_IN_LENGTH                       equ 0008h
PORTWIN4_IN_MASK                         equ 00FFh
PORTWIN4_IN0_POSN                        equ 0000h
PORTWIN4_IN0_POSITION                    equ 0000h
PORTWIN4_IN0_SIZE                        equ 0001h
PORTWIN4_IN0_LENGTH                      equ 0001h
PORTWIN4_IN0_MASK                        equ 0001h
PORTWIN4_IN1_POSN                        equ 0001h
PORTWIN4_IN1_POSITION                    equ 0001h
PORTWIN4_IN1_SIZE                        equ 0001h
PORTWIN4_IN1_LENGTH                      equ 0001h
PORTWIN4_IN1_MASK                        equ 0002h
PORTWIN4_IN2_POSN                        equ 0002h
PORTWIN4_IN2_POSITION                    equ 0002h
PORTWIN4_IN2_SIZE                        equ 0001h
PORTWIN4_IN2_LENGTH                      equ 0001h
PORTWIN4_IN2_MASK                        equ 0004h
PORTWIN4_IN3_POSN                        equ 0003h
PORTWIN4_IN3_POSITION                    equ 0003h
PORTWIN4_IN3_SIZE                        equ 0001h
PORTWIN4_IN3_LENGTH                      equ 0001h
PORTWIN4_IN3_MASK                        equ 0008h

// Register: PORTWIN5
#define PORTWIN5 PORTWIN5
PORTWIN5                                 equ 01F29h
// bitfield definitions
PORTWIN5_IN_POSN                         equ 0000h
PORTWIN5_IN_POSITION                     equ 0000h
PORTWIN5_IN_SIZE                         equ 0008h
PORTWIN5_IN_LENGTH                       equ 0008h
PORTWIN5_IN_MASK                         equ 00FFh
PORTWIN5_IN0_POSN                        equ 0000h
PORTWIN5_IN0_POSITION                    equ 0000h
PORTWIN5_IN0_SIZE                        equ 0001h
PORTWIN5_IN0_LENGTH                      equ 0001h
PORTWIN5_IN0_MASK                        equ 0001h
PORTWIN5_IN1_POSN                        equ 0001h
PORTWIN5_IN1_POSITION                    equ 0001h
PORTWIN5_IN1_SIZE                        equ 0001h
PORTWIN5_IN1_LENGTH                      equ 0001h
PORTWIN5_IN1_MASK                        equ 0002h
PORTWIN5_IN2_POSN                        equ 0002h
PORTWIN5_IN2_POSITION                    equ 0002h
PORTWIN5_IN2_SIZE                        equ 0001h
PORTWIN5_IN2_LENGTH                      equ 0001h
PORTWIN5_IN2_MASK                        equ 0004h
PORTWIN5_IN3_POSN                        equ 0003h
PORTWIN5_IN3_POSITION                    equ 0003h
PORTWIN5_IN3_SIZE                        equ 0001h
PORTWIN5_IN3_LENGTH                      equ 0001h
PORTWIN5_IN3_MASK                        equ 0008h

// Register: PORTWIN6
#define PORTWIN6 PORTWIN6
PORTWIN6                                 equ 01F2Ah
// bitfield definitions
PORTWIN6_IN_POSN                         equ 0000h
PORTWIN6_IN_POSITION                     equ 0000h
PORTWIN6_IN_SIZE                         equ 0008h
PORTWIN6_IN_LENGTH                       equ 0008h
PORTWIN6_IN_MASK                         equ 00FFh
PORTWIN6_IN0_POSN                        equ 0000h
PORTWIN6_IN0_POSITION                    equ 0000h
PORTWIN6_IN0_SIZE                        equ 0001h
PORTWIN6_IN0_LENGTH                      equ 0001h
PORTWIN6_IN0_MASK                        equ 0001h
PORTWIN6_IN1_POSN                        equ 0001h
PORTWIN6_IN1_POSITION                    equ 0001h
PORTWIN6_IN1_SIZE                        equ 0001h
PORTWIN6_IN1_LENGTH                      equ 0001h
PORTWIN6_IN1_MASK                        equ 0002h
PORTWIN6_IN2_POSN                        equ 0002h
PORTWIN6_IN2_POSITION                    equ 0002h
PORTWIN6_IN2_SIZE                        equ 0001h
PORTWIN6_IN2_LENGTH                      equ 0001h
PORTWIN6_IN2_MASK                        equ 0004h
PORTWIN6_IN3_POSN                        equ 0003h
PORTWIN6_IN3_POSITION                    equ 0003h
PORTWIN6_IN3_SIZE                        equ 0001h
PORTWIN6_IN3_LENGTH                      equ 0001h
PORTWIN6_IN3_MASK                        equ 0008h

// Register: PORTWIN7
#define PORTWIN7 PORTWIN7
PORTWIN7                                 equ 01F2Bh
// bitfield definitions
PORTWIN7_IN_POSN                         equ 0000h
PORTWIN7_IN_POSITION                     equ 0000h
PORTWIN7_IN_SIZE                         equ 0008h
PORTWIN7_IN_LENGTH                       equ 0008h
PORTWIN7_IN_MASK                         equ 00FFh
PORTWIN7_IN0_POSN                        equ 0000h
PORTWIN7_IN0_POSITION                    equ 0000h
PORTWIN7_IN0_SIZE                        equ 0001h
PORTWIN7_IN0_LENGTH                      equ 0001h
PORTWIN7_IN0_MASK                        equ 0001h
PORTWIN7_IN1_POSN                        equ 0001h
PORTWIN7_IN1_POSITION                    equ 0001h
PORTWIN7_IN1_SIZE                        equ 0001h
PORTWIN7_IN1_LENGTH                      equ 0001h
PORTWIN7_IN1_MASK                        equ 0002h
PORTWIN7_IN2_POSN                        equ 0002h
PORTWIN7_IN2_POSITION                    equ 0002h
PORTWIN7_IN2_SIZE                        equ 0001h
PORTWIN7_IN2_LENGTH                      equ 0001h
PORTWIN7_IN2_MASK                        equ 0004h
PORTWIN7_IN3_POSN                        equ 0003h
PORTWIN7_IN3_POSITION                    equ 0003h
PORTWIN7_IN3_SIZE                        equ 0001h
PORTWIN7_IN3_LENGTH                      equ 0001h
PORTWIN7_IN3_MASK                        equ 0008h

// Register: PORTWCLK
#define PORTWCLK PORTWCLK
PORTWCLK                                 equ 01F2Ch
// bitfield definitions
PORTWCLK_CLK_POSN                        equ 0000h
PORTWCLK_CLK_POSITION                    equ 0000h
PORTWCLK_CLK_SIZE                        equ 0008h
PORTWCLK_CLK_LENGTH                      equ 0008h
PORTWCLK_CLK_MASK                        equ 00FFh
PORTWCLK_CLK0_POSN                       equ 0000h
PORTWCLK_CLK0_POSITION                   equ 0000h
PORTWCLK_CLK0_SIZE                       equ 0001h
PORTWCLK_CLK0_LENGTH                     equ 0001h
PORTWCLK_CLK0_MASK                       equ 0001h
PORTWCLK_CLK1_POSN                       equ 0001h
PORTWCLK_CLK1_POSITION                   equ 0001h
PORTWCLK_CLK1_SIZE                       equ 0001h
PORTWCLK_CLK1_LENGTH                     equ 0001h
PORTWCLK_CLK1_MASK                       equ 0002h
PORTWCLK_CLK2_POSN                       equ 0002h
PORTWCLK_CLK2_POSITION                   equ 0002h
PORTWCLK_CLK2_SIZE                       equ 0001h
PORTWCLK_CLK2_LENGTH                     equ 0001h
PORTWCLK_CLK2_MASK                       equ 0004h
PORTWCLK_CLK3_POSN                       equ 0003h
PORTWCLK_CLK3_POSITION                   equ 0003h
PORTWCLK_CLK3_SIZE                       equ 0001h
PORTWCLK_CLK3_LENGTH                     equ 0001h
PORTWCLK_CLK3_MASK                       equ 0008h
PORTWCLK_CLK4_POSN                       equ 0004h
PORTWCLK_CLK4_POSITION                   equ 0004h
PORTWCLK_CLK4_SIZE                       equ 0001h
PORTWCLK_CLK4_LENGTH                     equ 0001h
PORTWCLK_CLK4_MASK                       equ 0010h
PORTWCLK_CLK5_POSN                       equ 0005h
PORTWCLK_CLK5_POSITION                   equ 0005h
PORTWCLK_CLK5_SIZE                       equ 0001h
PORTWCLK_CLK5_LENGTH                     equ 0001h
PORTWCLK_CLK5_MASK                       equ 0020h
PORTWCLK_CLK6_POSN                       equ 0006h
PORTWCLK_CLK6_POSITION                   equ 0006h
PORTWCLK_CLK6_SIZE                       equ 0001h
PORTWCLK_CLK6_LENGTH                     equ 0001h
PORTWCLK_CLK6_MASK                       equ 0040h
PORTWCLK_CLK7_POSN                       equ 0007h
PORTWCLK_CLK7_POSITION                   equ 0007h
PORTWCLK_CLK7_SIZE                       equ 0001h
PORTWCLK_CLK7_LENGTH                     equ 0001h
PORTWCLK_CLK7_MASK                       equ 0080h
PORTWCLK_PWCLK_POSN                      equ 0000h
PORTWCLK_PWCLK_POSITION                  equ 0000h
PORTWCLK_PWCLK_SIZE                      equ 0008h
PORTWCLK_PWCLK_LENGTH                    equ 0008h
PORTWCLK_PWCLK_MASK                      equ 00FFh

// Register: PORTWDF
#define PORTWDF PORTWDF
PORTWDF                                  equ 01F2Dh
// bitfield definitions
PORTWDF_DF0_POSN                         equ 0000h
PORTWDF_DF0_POSITION                     equ 0000h
PORTWDF_DF0_SIZE                         equ 0001h
PORTWDF_DF0_LENGTH                       equ 0001h
PORTWDF_DF0_MASK                         equ 0001h
PORTWDF_DF1_POSN                         equ 0001h
PORTWDF_DF1_POSITION                     equ 0001h
PORTWDF_DF1_SIZE                         equ 0001h
PORTWDF_DF1_LENGTH                       equ 0001h
PORTWDF_DF1_MASK                         equ 0002h
PORTWDF_DF2_POSN                         equ 0002h
PORTWDF_DF2_POSITION                     equ 0002h
PORTWDF_DF2_SIZE                         equ 0001h
PORTWDF_DF2_LENGTH                       equ 0001h
PORTWDF_DF2_MASK                         equ 0004h
PORTWDF_DF3_POSN                         equ 0003h
PORTWDF_DF3_POSITION                     equ 0003h
PORTWDF_DF3_SIZE                         equ 0001h
PORTWDF_DF3_LENGTH                       equ 0001h
PORTWDF_DF3_MASK                         equ 0008h
PORTWDF_DF4_POSN                         equ 0004h
PORTWDF_DF4_POSITION                     equ 0004h
PORTWDF_DF4_SIZE                         equ 0001h
PORTWDF_DF4_LENGTH                       equ 0001h
PORTWDF_DF4_MASK                         equ 0010h
PORTWDF_DF5_POSN                         equ 0005h
PORTWDF_DF5_POSITION                     equ 0005h
PORTWDF_DF5_SIZE                         equ 0001h
PORTWDF_DF5_LENGTH                       equ 0001h
PORTWDF_DF5_MASK                         equ 0020h
PORTWDF_DF6_POSN                         equ 0006h
PORTWDF_DF6_POSITION                     equ 0006h
PORTWDF_DF6_SIZE                         equ 0001h
PORTWDF_DF6_LENGTH                       equ 0001h
PORTWDF_DF6_MASK                         equ 0040h
PORTWDF_DF7_POSN                         equ 0007h
PORTWDF_DF7_POSITION                     equ 0007h
PORTWDF_DF7_SIZE                         equ 0001h
PORTWDF_DF7_LENGTH                       equ 0001h
PORTWDF_DF7_MASK                         equ 0080h
PORTWDF_PWDF0_POSN                       equ 0000h
PORTWDF_PWDF0_POSITION                   equ 0000h
PORTWDF_PWDF0_SIZE                       equ 0001h
PORTWDF_PWDF0_LENGTH                     equ 0001h
PORTWDF_PWDF0_MASK                       equ 0001h
PORTWDF_PWDF1_POSN                       equ 0001h
PORTWDF_PWDF1_POSITION                   equ 0001h
PORTWDF_PWDF1_SIZE                       equ 0001h
PORTWDF_PWDF1_LENGTH                     equ 0001h
PORTWDF_PWDF1_MASK                       equ 0002h
PORTWDF_PWDF2_POSN                       equ 0002h
PORTWDF_PWDF2_POSITION                   equ 0002h
PORTWDF_PWDF2_SIZE                       equ 0001h
PORTWDF_PWDF2_LENGTH                     equ 0001h
PORTWDF_PWDF2_MASK                       equ 0004h
PORTWDF_PWDF3_POSN                       equ 0003h
PORTWDF_PWDF3_POSITION                   equ 0003h
PORTWDF_PWDF3_SIZE                       equ 0001h
PORTWDF_PWDF3_LENGTH                     equ 0001h
PORTWDF_PWDF3_MASK                       equ 0008h
PORTWDF_PWDF4_POSN                       equ 0004h
PORTWDF_PWDF4_POSITION                   equ 0004h
PORTWDF_PWDF4_SIZE                       equ 0001h
PORTWDF_PWDF4_LENGTH                     equ 0001h
PORTWDF_PWDF4_MASK                       equ 0010h
PORTWDF_PWDF5_POSN                       equ 0005h
PORTWDF_PWDF5_POSITION                   equ 0005h
PORTWDF_PWDF5_SIZE                       equ 0001h
PORTWDF_PWDF5_LENGTH                     equ 0001h
PORTWDF_PWDF5_MASK                       equ 0020h
PORTWDF_PWDF6_POSN                       equ 0006h
PORTWDF_PWDF6_POSITION                   equ 0006h
PORTWDF_PWDF6_SIZE                       equ 0001h
PORTWDF_PWDF6_LENGTH                     equ 0001h
PORTWDF_PWDF6_MASK                       equ 0040h
PORTWDF_PWDF7_POSN                       equ 0007h
PORTWDF_PWDF7_POSITION                   equ 0007h
PORTWDF_PWDF7_SIZE                       equ 0001h
PORTWDF_PWDF7_LENGTH                     equ 0001h
PORTWDF_PWDF7_MASK                       equ 0080h
PORTWDF_DF_POSN                          equ 0000h
PORTWDF_DF_POSITION                      equ 0000h
PORTWDF_DF_SIZE                          equ 0008h
PORTWDF_DF_LENGTH                        equ 0008h
PORTWDF_DF_MASK                          equ 00FFh
PORTWDF_PWDF_POSN                        equ 0000h
PORTWDF_PWDF_POSITION                    equ 0000h
PORTWDF_PWDF_SIZE                        equ 0008h
PORTWDF_PWDF_LENGTH                      equ 0008h
PORTWDF_PWDF_MASK                        equ 00FFh

// Register: PORTWCON
#define PORTWCON PORTWCON
PORTWCON                                 equ 01F2Eh
// bitfield definitions
PORTWCON_CLKEN_POSN                      equ 0000h
PORTWCON_CLKEN_POSITION                  equ 0000h
PORTWCON_CLKEN_SIZE                      equ 0001h
PORTWCON_CLKEN_LENGTH                    equ 0001h
PORTWCON_CLKEN_MASK                      equ 0001h
PORTWCON_CPOL_POSN                       equ 0004h
PORTWCON_CPOL_POSITION                   equ 0004h
PORTWCON_CPOL_SIZE                       equ 0001h
PORTWCON_CPOL_LENGTH                     equ 0001h
PORTWCON_CPOL_MASK                       equ 0010h
PORTWCON_PWCLKEN_POSN                    equ 0000h
PORTWCON_PWCLKEN_POSITION                equ 0000h
PORTWCON_PWCLKEN_SIZE                    equ 0001h
PORTWCON_PWCLKEN_LENGTH                  equ 0001h
PORTWCON_PWCLKEN_MASK                    equ 0001h
PORTWCON_PWCPOL_POSN                     equ 0004h
PORTWCON_PWCPOL_POSITION                 equ 0004h
PORTWCON_PWCPOL_SIZE                     equ 0001h
PORTWCON_PWCPOL_LENGTH                   equ 0001h
PORTWCON_PWCPOL_MASK                     equ 0010h

// Register: APMCON
#define APMCON APMCON
APMCON                                   equ 01F4Ch
// bitfield definitions
APMCON_EN_POSN                           equ 0007h
APMCON_EN_POSITION                       equ 0007h
APMCON_EN_SIZE                           equ 0001h
APMCON_EN_LENGTH                         equ 0001h
APMCON_EN_MASK                           equ 0080h
APMCON_APMEN_POSN                        equ 0007h
APMCON_APMEN_POSITION                    equ 0007h
APMCON_APMEN_SIZE                        equ 0001h
APMCON_APMEN_LENGTH                      equ 0001h
APMCON_APMEN_MASK                        equ 0080h

// Register: APMPREL
#define APMPREL APMPREL
APMPREL                                  equ 01F4Dh
// bitfield definitions
APMPREL_PRE_POSN                         equ 0000h
APMPREL_PRE_POSITION                     equ 0000h
APMPREL_PRE_SIZE                         equ 0008h
APMPREL_PRE_LENGTH                       equ 0008h
APMPREL_PRE_MASK                         equ 00FFh
APMPREL_PRE0_POSN                        equ 0000h
APMPREL_PRE0_POSITION                    equ 0000h
APMPREL_PRE0_SIZE                        equ 0001h
APMPREL_PRE0_LENGTH                      equ 0001h
APMPREL_PRE0_MASK                        equ 0001h
APMPREL_PRE1_POSN                        equ 0001h
APMPREL_PRE1_POSITION                    equ 0001h
APMPREL_PRE1_SIZE                        equ 0001h
APMPREL_PRE1_LENGTH                      equ 0001h
APMPREL_PRE1_MASK                        equ 0002h
APMPREL_PRE2_POSN                        equ 0002h
APMPREL_PRE2_POSITION                    equ 0002h
APMPREL_PRE2_SIZE                        equ 0001h
APMPREL_PRE2_LENGTH                      equ 0001h
APMPREL_PRE2_MASK                        equ 0004h
APMPREL_PRE3_POSN                        equ 0003h
APMPREL_PRE3_POSITION                    equ 0003h
APMPREL_PRE3_SIZE                        equ 0001h
APMPREL_PRE3_LENGTH                      equ 0001h
APMPREL_PRE3_MASK                        equ 0008h
APMPREL_PRE4_POSN                        equ 0004h
APMPREL_PRE4_POSITION                    equ 0004h
APMPREL_PRE4_SIZE                        equ 0001h
APMPREL_PRE4_LENGTH                      equ 0001h
APMPREL_PRE4_MASK                        equ 0010h
APMPREL_PRE5_POSN                        equ 0005h
APMPREL_PRE5_POSITION                    equ 0005h
APMPREL_PRE5_SIZE                        equ 0001h
APMPREL_PRE5_LENGTH                      equ 0001h
APMPREL_PRE5_MASK                        equ 0020h
APMPREL_PRE6_POSN                        equ 0006h
APMPREL_PRE6_POSITION                    equ 0006h
APMPREL_PRE6_SIZE                        equ 0001h
APMPREL_PRE6_LENGTH                      equ 0001h
APMPREL_PRE6_MASK                        equ 0040h
APMPREL_PRE7_POSN                        equ 0007h
APMPREL_PRE7_POSITION                    equ 0007h
APMPREL_PRE7_SIZE                        equ 0001h
APMPREL_PRE7_LENGTH                      equ 0001h
APMPREL_PRE7_MASK                        equ 0080h
APMPREL_APMPRE_POSN                      equ 0000h
APMPREL_APMPRE_POSITION                  equ 0000h
APMPREL_APMPRE_SIZE                      equ 0008h
APMPREL_APMPRE_LENGTH                    equ 0008h
APMPREL_APMPRE_MASK                      equ 00FFh
APMPREL_APMPRE0_POSN                     equ 0000h
APMPREL_APMPRE0_POSITION                 equ 0000h
APMPREL_APMPRE0_SIZE                     equ 0001h
APMPREL_APMPRE0_LENGTH                   equ 0001h
APMPREL_APMPRE0_MASK                     equ 0001h
APMPREL_APMPRE1_POSN                     equ 0001h
APMPREL_APMPRE1_POSITION                 equ 0001h
APMPREL_APMPRE1_SIZE                     equ 0001h
APMPREL_APMPRE1_LENGTH                   equ 0001h
APMPREL_APMPRE1_MASK                     equ 0002h
APMPREL_APMPRE2_POSN                     equ 0002h
APMPREL_APMPRE2_POSITION                 equ 0002h
APMPREL_APMPRE2_SIZE                     equ 0001h
APMPREL_APMPRE2_LENGTH                   equ 0001h
APMPREL_APMPRE2_MASK                     equ 0004h
APMPREL_APMPRE3_POSN                     equ 0003h
APMPREL_APMPRE3_POSITION                 equ 0003h
APMPREL_APMPRE3_SIZE                     equ 0001h
APMPREL_APMPRE3_LENGTH                   equ 0001h
APMPREL_APMPRE3_MASK                     equ 0008h
APMPREL_APMPRE4_POSN                     equ 0004h
APMPREL_APMPRE4_POSITION                 equ 0004h
APMPREL_APMPRE4_SIZE                     equ 0001h
APMPREL_APMPRE4_LENGTH                   equ 0001h
APMPREL_APMPRE4_MASK                     equ 0010h
APMPREL_APMPRE5_POSN                     equ 0005h
APMPREL_APMPRE5_POSITION                 equ 0005h
APMPREL_APMPRE5_SIZE                     equ 0001h
APMPREL_APMPRE5_LENGTH                   equ 0001h
APMPREL_APMPRE5_MASK                     equ 0020h
APMPREL_APMPRE6_POSN                     equ 0006h
APMPREL_APMPRE6_POSITION                 equ 0006h
APMPREL_APMPRE6_SIZE                     equ 0001h
APMPREL_APMPRE6_LENGTH                   equ 0001h
APMPREL_APMPRE6_MASK                     equ 0040h
APMPREL_APMPRE7_POSN                     equ 0007h
APMPREL_APMPRE7_POSITION                 equ 0007h
APMPREL_APMPRE7_SIZE                     equ 0001h
APMPREL_APMPRE7_LENGTH                   equ 0001h
APMPREL_APMPRE7_MASK                     equ 0080h

